def is_balanced(parentheses: str) -> bool:     #створюемо функцію яка приймае аргумент в рядках і потім перетвопюемо іі в bool , буде повертати True / False
    count = 0                                 #створюемо count і вона буде разувати баланс відкритих і закритих дужок
    for character in parentheses:             #проходимо по кожному символу в рядку який передаемо у функцію
        if character == '(':                 #якщо символ це є відкрита дужка
            count += 1                       # то додаемо одну відкриту дужку
        elif character == ')':               #якщо символ це є закрита дужка
            count -= 1                   #зменьшуемо лічний на 1  закриваемо одну  дужку
            if count < 0:                #якщо ми отримуемо що одноі щ дужое більше чи откриті чи закриті, тобто немає баланму дужок
                return False             # тоді повертаемо False - вони не сбалансовані
    return count == 0                    # тут якщо все душки відкрилисб і закрились тобно сбалансовані і дорівнюе == 0 , якщо не дорівеює ==0 тоді це всі дужки закрились чи вони там зайві

print(is_balanced('()'))        #одна відкрита і одна закрита - True
print(is_balanced('())'))       # одна дужка закрилась тут false
print(is_balanced('(()'))       #  одна відкрита, але не закрита  тут False
print(is_balanced(')())'))      # починається з закритої дужки і тут влагалі буде помилка  - False
print(is_balanced('(())()'))    # тут всі дужки збалансовані - True
print(is_balanced('((()))'))    # дужки закриті в правильному порядку  - True
print(is_balanced('((())'))     # одна дужка відкрилась, але не закрилась - False
